module.exports.config = {
  name: "صراحة",
  version: "1.1.2",
  permission: 0,
  credits: "عمر",
  description: "البوت يسألك أسئلة صراحة عشوائية",
  commandCategory: "ترفية",
  usages: "",
  cooldowns: 1,
};

module.exports.run = async function ({ api, event, args }) {
  const { threadID, messageID } = event;

  // قائمة الأسئلة
  const questions = [
    "ما أسوأ شيء فعلته في الحياة؟",
    "ما آخر قرار أخذته وندمت عليه؟",
    "ما أكثر شيء تكرهه في نفسك؟",
    "هل ظلمت أحد من قبل؟ كيف؟",
    "كيف ولماذا تركك الحبيب؟",
    "هل أحببت من طرف واحد من قبل؟",
    "هل غدر بك أعز صديق لك؟ كيف؟",
    "إذا خيرت بين الزواج والعمل أي منهما ستختار؟",
    "ما هو الشيء الذي يمثل لك خط أحمر؟",
    "ما هي الأفكار الجنونية التي تراودك؟",
    "من أول حب في حياتك؟ وما هي نهاية هذه القصة؟",
    "من أقرب شخص لك في هذه الغرفة؟",
    "هل من الممكن أن تعرض على شخص تحبه الزواج؟",
    "كم عدد تجاربك العاطفية؟",
    "أوصف حياتك في كلمة؟",
    "هل لا تستطيع النوم بسبب شخص أو ذكريات؟",
    "ما الشيء الذي تخاف منه؟",
    "هل حاولت الانتحار من قبل؟ لماذا؟",
    "ما السبب في بكائك آخر مرة؟",
    "هل أنت راضٍ عن نفسك؟ لماذا؟",
    "إذا رجعت للماضي وغيرت شيء واحد ماذا سيكون؟",
    "صراحة | صوتك حلو؟",
    "صراحة | التقيت ناس بوجهين؟",
    "صراحة | هل تكذب أحيانًا لإنقاذ موقف؟",
    "صراحة | من أول شخص يخطر على بالك عند وقوعك في مشكلة؟",
    "صراحة | مع مين ودك تنام اليوم؟",
    "صراحة | هل تحب عائلتك؟",
    "صراحة | هل تعرضت لموقف محرج لا يُنسى؟",
    "صراحة | ما هي أجمل سنة عشتها في حياتك؟",
    "صراحة | نفسك في ايه؟",
    "صراحة | هل تحب فتاة أو أحببت من قبل؟",
    "صراحة | ما المادة الدراسية التي كنت تفضلها؟",
    "صراحة | هل تحب مدرستك؟",
    "صراحة | ما هي أمنياتك المستقبلية؟",
  ];

  // اختيار عشوائي
  const randomQuestion = questions[Math.floor(Math.random() * questions.length)];

  return api.sendMessage(`❓ سؤال صراحة:\n${randomQuestion}`, threadID, messageID);
};
